# <center>  Juypter SQL Database

Creating a database with a series of tables for some example queries. We will only be able to createa database smaller than 20mb to get around githubs filesize limit.

Database Source: https://www.w3resource.com/sql/sql-table.php

In [2]:
%load_ext sql

In [3]:
%sql sqlite://

'Connected: None@None'

In [4]:
%%sql
DROP TABLE IF EXISTS writer;
CREATE TABLE writer (first_name, last_name, year_of_death);
INSERT INTO writer VALUES ('Wiliam','Shakespeare', 1616);
INSERT INTO writer VALUES ('Bertold', 'Brecht', 1956);

Done.
Done.
1 rows affected.
1 rows affected.

[]

In [5]:
%sql SELECT * FROM writer

Done.

[('Wiliam', 'Shakespeare', 1616), ('Bertold', 'Brecht', 1956)]

##### Assinging Values to Pandas

In [16]:
# assigning query to a variable
result = %sql SELECT * FROM writer
result

Done.

[('Wiliam', 'Shakespeare', 1616), ('Bertold', 'Brecht', 1956)]

In [13]:
# view the result of the query via a variable
import pandas as pd
df = pd.DataFrame(result)
df

         0            1     2
0   Wiliam  Shakespeare  1616
1  Bertold       Brecht  1956